Revit 2027 API
EnergyAnalysisWindowType.SolarHeatGainCoefficient Property
 The solar heat gain coefficient (SHGC-value) for the window type, from 0.0 to 1.0.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SolarHeatGainCoefficient { get; }
Public ReadOnly Property SolarHeatGainCoefficient As Double
	Get
public:
property double SolarHeatGainCoefficient {
	double get ();
}
member SolarHeatGainCoefficient : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace